Repository: CofficLab/Lumi
Catalog: Plugins/LLMProviderAliyunPlugin/Resources/Localizable.xcstrings
Source language: en
Languages: zh_hans, zh_hk

source: Aliyun API Key invalid or expired
zh_hans: 阿里云 API Key 无效或已过期
zh_hk: 阿里雲 API Key 無效或已過期

source: Aliyun API Key required
zh_hans: 需要配置阿里云 API Key
zh_hk: 需要配置阿里雲 API Key

source: Aliyun HTTP %lld
zh_hans: 阿里云 HTTP %lld
zh_hk: 阿里雲 HTTP %lld

source: Aliyun request failed
zh_hans: 阿里云请求失败
zh_hk: 阿里雲請求失敗

source: Configure your Aliyun API Key below, then resend your message.
zh_hans: 请在下方填写阿里云 API Key，配置完成后重新发送消息即可。
zh_hk: 請在下方填寫阿里雲 API Key，設定完成後重新發送訊息即可。

source: Contributes Aliyun CodingPlan and Aliyun TokenPlan models and Aliyun-specific chat error renderers.
zh_hans: 提供阿里云 CodingPlan 和 TokenPlan 模型以及阿里云专用聊天错误渲染器。
zh_hk: 提供阿里雲 CodingPlan 和 TokenPlan 模型以及阿里雲專用聊天錯誤渲染器。

source: Copy
zh_hans: 复制
zh_hk: 複製

source: Enter Aliyun API Key
zh_hans: 输入阿里云 API Key
zh_hk: 輸入阿里雲 API Key

source: Error
zh_hans: 错误
zh_hk: 錯誤

source: Get API Key on Aliyun Model Studio
zh_hans: 前往阿里云 Model Studio 获取 API Key
zh_hk: 前往阿里雲 Model Studio 取得 API Key

source: Hide API Key
zh_hans: 隐藏 API Key
zh_hk: 隱藏 API Key

source: Parsing details...
zh_hans: 正在解析详情...
zh_hk: 正在解析詳情...

source: Raw error details
zh_hans: 原始错误详情
zh_hk: 原始錯誤詳情

source: Received Data
zh_hans: 收到的数据
zh_hk: 收到的資料

source: Request / Response Details
zh_hans: 请求与响应详情
zh_hk: 請求與回應詳情

source: Sending Data
zh_hans: 发送的数据
zh_hk: 發送的資料

source: Show API Key
zh_hans: 显示 API Key
zh_hk: 顯示 API Key

source: Show raw error details
zh_hans: 查看原始错误详情
zh_hk: 查看原始錯誤詳情

source: Show request and response details
zh_hans: 查看请求与响应详情
zh_hk: 查看請求與回應詳情

source: This model is not included in your Coding Plan
zh_hans: 此模型不在当前 Coding Plan 支持范围内
zh_hk: 此模型不在目前 Coding Plan 支援範圍內

source: Toggle raw message
zh_hans: 显示/隐藏原始错误
zh_hk: 顯示/隱藏原始錯誤

source: Toggle request and response details
zh_hans: 展开/收起请求与响应详情
zh_hk: 展開/收起請求與回應詳情

source: Use a Coding Plan API Key (sk-sp-...) from Model Studio. Update it below, then resend your message.
zh_hans: 请使用 Model Studio 的 Coding Plan 专属 API Key（sk-sp-...）。在下方更新后重新发送消息。
zh_hk: 請使用 Model Studio 的 Coding Plan 專屬 API Key（sk-sp-...）。在下方更新後重新發送訊息。

# 阿里云 CodingPlan
source: Aliyun CodingPlan
zh_hans: 阿里云 CodingPlan
zh_hk: 阿里雲 CodingPlan

# 阿里云 DashScope Coding Plan（兼容 Anthropic API）
source: Aliyun DashScope Coding Plan (Anthropic API compatible)
zh_hans: 阿里云 DashScope Coding Plan（兼容 Anthropic API）
zh_hk: 阿里雲 DashScope Coding Plan（兼容 Anthropic API）

# 阿里云 DashScope Token Plan
source: Aliyun DashScope Token Plan
zh_hans: 阿里云 DashScope Token Plan
zh_hk: 阿里雲 DashScope Token Plan

# 阿里云 TokenPlan
source: Aliyun TokenPlan
zh_hans: 阿里云 TokenPlan
zh_hk: 阿里雲 TokenPlan
